Service - Intermediation/sample messages/RetrieveClient-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header>
      <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Intermediation/Intermediation/RetrieveClient</wsa:Action>
   </soap:Header>
   <soap:Body>
      <int:RetrieveClient xmlns:int="https://services.ird.govt.nz/GWS/Intermediation/" xmlns:ret="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientRequest" xmlns:int1="urn:www.ird.govt.nz/GWS:types/Intermediation.v1" xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
         <int:RetrieveClientRequestMsg>
            <ret:RetrieveClientRequestWrapper>
               <int1:retrieveClientRequest>
                  <cmn:softwareProviderData>
                     <cmn:softwareProvider>Software Provider</cmn:softwareProvider>
                     <cmn:softwarePlatform>Software_Platform</cmn:softwarePlatform>
                     <cmn:softwareRelease>1.0</cmn:softwareRelease>
                  </cmn:softwareProviderData>
                  <cmn:identifier IdentifierValueType="IRD">132261132</cmn:identifier>
                  <int1:client>
                     <int1:clientID IdentifierValueType="ACCIRD">077415807</int1:clientID>
                     <int1:clientAccountType>EMP</int1:clientAccountType>
                  </int1:client>
               </int1:retrieveClientRequest>
            </ret:RetrieveClientRequestWrapper>
         </int:RetrieveClientRequestMsg>
      </int:RetrieveClient>
   </soap:Body>
</soap:Envelope>